In [14]:
import datasets
from datasets import load_dataset
import ast
dataset = load_dataset('lukebarousse/data_jobs')

df = dataset['train'].to_pandas()

## Sorting & Ranking

 11. Top 10 highest salaries

In [15]:
top_ten_salary = df[['job_title_short', 'salary_year_avg']].sort_values(by='salary_year_avg', ascending=False).head(10)
top_ten_salary

              job_title_short  salary_year_avg
554784         Data Scientist         960000.0
665811  Senior Data Scientist         890000.0
168402           Data Analyst         650000.0
387378         Data Scientist         585000.0
160521         Data Scientist         550000.0
554140         Data Scientist         525000.0
404932          Data Engineer         525000.0
417241  Senior Data Scientist         475000.0
618461  Senior Data Scientist         463500.0
124265         Data Scientist         450000.0

12. Top 10 lowest salaries

In [16]:
top_ten_salary = df[['job_title_short', 'salary_year_avg']].sort_values(by='salary_year_avg').head(10)
top_ten_salary

         job_title_short  salary_year_avg
665729     Data Engineer          15000.0
380187  Business Analyst          16500.0
130855     Data Engineer          20000.0
535260     Data Engineer          23496.0
213687     Data Engineer          24000.0
252564      Data Analyst          25000.0
260702     Data Engineer          25000.0
248548     Data Engineer          25000.0
704118      Data Analyst          25920.0
365886      Data Analyst          26444.0

13. Jobs sorted by post date

In [17]:
import pandas as pd
from datetime import datetime

df['job_posted_date'] = pd.to_datetime(df['job_posted_date']).dt.date
sorted_date =df[['job_posted_date','job_title']].sort_values(by = 'job_posted_date',ascending=False)
sorted_date

       job_posted_date                                          job_title
287457      2023-12-31                               Senior Data Engineer
233330      2023-12-31                                       Data Analyst
528676      2023-12-31  Data Engineer (Híbrida en Monterrey o Ciudad M...
165223      2023-12-31  HYBRID -DATA ENGINEER- (AWS) Certified Data An...
499568      2023-12-31                                 Analytics Engineer
...                ...                                                ...
776626      2023-01-01               Application Support Analyst with SQL
295569      2023-01-01    Senior Data Scientist/Computer Vision Scientist
365141      2023-01-01                                       Data Analyst
82608       2023-01-01     Senior Solution Analyst- GAMMA Retail Catalyst
347766      2023-01-01                    Manager, Data Engineering, SMAI

[785741 rows x 2 columns]

14. Most recent job posting

In [18]:
recent_job = [df[['job_title_short','job_posted_date']].max()]
recent_job

[job_title_short    Software Engineer
 job_posted_date           2023-12-31
 dtype: object]

15. Companies posting the highest number of jobs

In [19]:
companies_with_more_job = (df.groupby('company_name')
                           .size()
                           .reset_index(name='job_count')
                           .sort_values(by = 'job_count',ascending=False)
                           .head()
)
companies_with_more_job

              company_name  job_count
39719              Emprego       6664
18371  Booz Allen Hamilton       2879
34860                 Dice       2827
53029              Harnham       2547
60218       Insight Global       2254

16. Highest paying remote jobs

In [20]:
# filter for remote jobs
remote_jobs = df[df['job_work_from_home'] == True] 
remote_jobs = remote_jobs.sort_values(by='salary_year_avg', ascending=False).head()

remote_jobs[['job_title_short', 'salary_year_avg']]

              job_title_short  salary_year_avg
168402           Data Analyst         650000.0
160521         Data Scientist         550000.0
554140         Data Scientist         525000.0
417241  Senior Data Scientist         475000.0
663198  Senior Data Scientist         375000.0

17. Highest paid job in India

In [21]:
jobs_in_india = df[df['job_country'] == 'India']
jobs_in_india = jobs_in_india.sort_values(by='salary_year_avg', ascending=False).head(1)

jobs_in_india[['job_title_short', 'salary_year_avg','job_country']]

       job_title_short  salary_year_avg job_country
168402    Data Analyst         650000.0       India

18. Highest paid job type

In [22]:

df_sal = df[df['salary_year_avg'].notna()]
df_sal =(df_sal.groupby('job_schedule_type')['salary_year_avg']
         .mean()
         .reset_index(name='salary')
         .sort_values(by = 'salary',ascending=False).max()
)
df_sal

job_schedule_type    Temp work
salary                320000.0
dtype: object

19. Highest salary per country

In [23]:
highest_paid_salary = df[df['salary_year_avg'].notna()]
highest_paid_salary =(highest_paid_salary.groupby('job_country')['salary_year_avg']
                      .max()
                      .reset_index(name='highest_salary')
                      .sort_values(by='highest_salary',ascending =False)
)
highest_paid_salary

       job_country  highest_salary
102  United States        960000.0
86    South Africa        890000.0
40           India        650000.0
90           Sudan        550000.0
9          Belarus        400000.0
..             ...             ...
47          Jordan         70000.0
37        Honduras         63000.0
60      Montenegro         53014.0
1          Algeria         45000.0
104     Uzbekistan         30750.0

[108 rows x 2 columns]

20. Top 5 skills demanded

In [ ]:
import ast
import pandas as pd

# Convert string representation of lists into actual lists
df['job_skills'] = df['job_skills'].apply(lambda x: ast.literal_eval(x) if pd.notna(x) else x)

# Explode the skills into separate rows
skills_exploded = df.explode('job_skills').reset_index(drop=True)

skills_exploded['job_skills'].value_counts().sort_values(ascending=False).head(5)